In [1]:
import pandas as pd

In [1]:

data = {'Name': ['Alice', 'Bob', 'Charlie'],
        'Age': [25, 30, 35]}

df = pd.DataFrame(data)

In [2]:
df

      Name  Age
0    Alice   25
1      Bob   30
2  Charlie   35

In [3]:
new_row = {"mid":"ggougoi6654",'Name': 'David', 'Age': 28}

In [8]:
new_df = pd.DataFrame(new_row,index =[0])
new_df

    Name  Age
0  David   28

In [13]:
df = pd.concat([df,new_df],ignore_index = True)

In [14]:
# df.to_csv("tempo.csv")

In [15]:
df

      Name  Age
0    Alice   25
1      Bob   30
2  Charlie   35
3    David   28

In [18]:
list(df["Name"])

['Alice', 'Bob', 'Charlie', 'David']

In [3]:
qdata = {"Qid":[],
       "text":[],
       "author":[],
       "mID":[]}

In [4]:
df = pd.DataFrame(data)

In [5]:
df

Empty DataFrame
Columns: [Qid, text, author, mID]
Index: []

In [8]:
df.to_csv("./quotes.csv")

In [9]:
df

Empty DataFrame
Columns: [Qid, text, author, mID]
Index: []

In [10]:
aq = df[["author","text"]]

In [11]:
aq

Empty DataFrame
Columns: [author, text]
Index: []

In [16]:

# Create a sample DataFrame
data = {'mid': ['ggougoi6654', 'hjkl9876', 'abcd1234'],
        'Name': ['Alice', 'David', 'Charlie'],
        'Age': [25, 28, 35]}

df = pd.DataFrame(data)

In [18]:
# Search for "David" and retrieve the corresponding "mid"
david_mid = df.loc[df['Name'] == 'David', ['mid',"Age"]]

# Print the "mid" associated with "David"
print(david_mid)

        mid  Age
1  hjkl9876   28

In [19]:
type(david_mid)

pandas.core.frame.DataFrame

In [20]:
print(david_mid.values)

[['hjkl9876' 28]]

In [21]:
5+5

10

In [ ]:
# Search for "David" and retrieve the corresponding "mid"
david_mid = df.loc[df['Name'] == 'David', 'mid'].values[0]

# Print the "mid" associated with "David"
print(david_mid)

In [22]:
df = pd.read_csv("./IDPass.csv")
df

                                    mID        emailID             password
0  56f3d07e-675a-11ee-8612-ff5ae65b72d3        pritesh         Hello@123456
1  d6bc21d0-675a-11ee-8612-ff5ae65b72d3              5         9892901083@a
2  db31d35e-6764-11ee-8612-ff5ae65b72d3           prit          D@123546789
3  ed8616dc-6764-11ee-8612-ff5ae65b72d3            lrb        lrb123456789!
4  f894cdde-6764-11ee-8612-ff5ae65b72d3           dsfg   adf52@4887514dfasd
5  547eee36-6765-11ee-8612-ff5ae65b72d3        Psdfsad   asdf2@q234q2345456
6  5dc2bb76-6765-11ee-8612-ff5ae65b72d3  Pasdfasdfasdf  P@1456dsfsadgfafrga

In [35]:
df = pd.read_csv("./quotes.csv")
df

,Qid,text,author,mID
0,dee1005e-676b-11ee-8612-ff5ae65b72d3,One step at a time,Unknown,56f3d07e-675a-11ee-8612-ff5ae65b72d3
1,f673fe64-676c-11ee-8612-ff5ae65b72d3,Live life full size,Scorpio,d6bc21d0-675a-11ee-8612-ff5ae65b72d3
2,ffbb9310-676c-11ee-8612-ff5ae65b72d3,Nothing like anything,Micromax,d6bc21d0-675a-11ee-8612-ff5ae65b72d3

In [36]:
df[["text","author"]]

                    text    author
0     One step at a time   Unknown
1    Live life full size   Scorpio
2  Nothing like anything  Micromax

In [37]:
val = 1

In [40]:
miid = 	"d6bc21d0-675a-11ee-8612-ff5ae65b72d3"

In [45]:
x = df.iloc[[val]]

In [48]:
x.values[0][3]

'd6bc21d0-675a-11ee-8612-ff5ae65b72d3'

In [49]:
df

,Qid,text,author,mID
0,dee1005e-676b-11ee-8612-ff5ae65b72d3,One step at a time,Unknown,56f3d07e-675a-11ee-8612-ff5ae65b72d3
1,f673fe64-676c-11ee-8612-ff5ae65b72d3,Live life full size,Scorpio,d6bc21d0-675a-11ee-8612-ff5ae65b72d3
2,ffbb9310-676c-11ee-8612-ff5ae65b72d3,Nothing like anything,Micromax,d6bc21d0-675a-11ee-8612-ff5ae65b72d3

In [28]:
import pandas as pd

# Create a sample DataFrame
data = {'A': [1, 2, 3],
        'B': [4, 5, 6],
        'C': [7, 8, 9]}

df = pd.DataFrame(data)

In [29]:
df

   A  B  C
0  1  4  7
1  2  5  8
2  3  6  9

In [30]:

# Select a single element (row 0, column 1)
element = df.iloc[0, 1]  # element is 4
element

4

In [32]:

# Select a single column (column 2)
column = df.iloc[:, 2]  # column is a Series containing [7, 8, 9]
column

0    7
1    8
2    9
Name: C, dtype: int64

In [33]:
# Select a subset of rows and columns
subset = df.iloc[1:3, 0:2]  # subset is a DataFrame containing rows 1 and 2, and columns 0 and 1

In [34]:
subset

   A  B
1  2  5
2  3  6